import { CommentDTO } from 'types/types';

export const MOCK_COMMENTS: CommentDTO[] = [
  {
    firstName: 'Иван',
    lastName: 'Иванов',
    publishAt: '2019-01-05T19:15:43.079Z',
    rating: 4.4,
  },
  {
    firstName: 'Николай',
    lastName: 'Качков',
    publishAt: '2018-06-20T19:15:43.079Z',
    rating: 4.3,
    comment:
      'Учитывая ключевые сценарии поведения, курс на социально-ориентированный национальный проект не оставляет шанса для анализа существующих паттернов поведения. Для современного мира внедрение современных методик предоставляет широкие возможности для позиций, занимаемых участниками в отношении поставленных задач. Как уже неоднократно упомянуто, сделанные на базе интернет-аналитики выводы будут в равной степени предоставлены сами себе. Вот вам яркий пример современных тенденций — глубокий уровень погружения создаёт предпосылки для своевременного выполнения сверхзадачи. И нет сомнений, что акционеры крупнейших компаний, инициированные исключительно синтетически, превращены в посмешище, хотя само их существование приносит несомненную пользу обществу.',
  },
  {
    firstName: 'Екатерина',
    lastName: 'Беляева',
    publishAt: '2018-02-28T19:15:43.079Z',
    rating: 4.3,
  },
];
